Tekla.Structures.Model.CircleRebarGroup
The CircleRebarGroup class represents a group of reinforcing bars which have a circular shape.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Beam Beam = new Beam(new Point(5000, 8000, 0), new Point(6000, 8000, 0));
Beam.Profile.ProfileString = "250*250";
Beam.Material.MaterialString = "K40-1";
Beam.Finish = "PAINT";
Beam.Insert();
double MinimumX = Beam.GetSolid().MinimumPoint.X;
double MinimumY = Beam.GetSolid().MinimumPoint.Y;
double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
double MaximumX = Beam.GetSolid().MaximumPoint.X;
double MaximumY = Beam.GetSolid().MaximumPoint.Y;
double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
CircleRebarGroup CircleRebarGroup = new CircleRebarGroup();
CircleRebarGroup.Polygon.Points.Add(new Point(MinimumX, MaximumY, MinimumZ));
CircleRebarGroup.Polygon.Points.Add(new Point(MinimumX, MinimumY, MinimumZ));
CircleRebarGroup.Polygon.Points.Add(new Point(MinimumX, MinimumY, MaximumZ));
CircleRebarGroup.StartPoint = new Point(MinimumX, MaximumY, MinimumZ);
CircleRebarGroup.EndPoint = new Point(MaximumX, MaximumY, MinimumZ);
CircleRebarGroup.Father = Beam;
CircleRebarGroup.RadiusValues.Add(40.0);
CircleRebarGroup.SpacingType = BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACINGS;
CircleRebarGroup.Spacings.Add(300);
CircleRebarGroup.ExcludeType = BaseRebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_NONE;
CircleRebarGroup.Name = "RebarGroup";
CircleRebarGroup.Class = 3;
CircleRebarGroup.Size = "10";
CircleRebarGroup.NumberingSeries.StartNumber = 0;
CircleRebarGroup.NumberingSeries.Prefix = "Group";
CircleRebarGroup.Grade = "A500HW";
CircleRebarGroup.StirrupType = CircleRebarGroup.CircleRebarGroupStirrupTypeEnum.STIRRUP_TYPE_CIRCLE;
CircleRebarGroup.Insert();
}
}

Tekla.Structures.Model.CircleRebarGroup.Polygon
A polygon definition for the circle reinforcing bar group shape. The polygon must have 3 points.

Tekla.Structures.Model.CircleRebarGroup.StirrupType
The type of the stirrup.
The options are:
STIRRUP_TYPE_CIRCLE
STIRRUP_TYPE_SPIRAL

Tekla.Structures.Model.CircleRebarGroup.#ctor
Initializes a new circle rebar group instance with empty attributes.

Tekla.Structures.Model.CircleRebarGroup.Insert
Inserts the circle rebar group into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.CircleRebarGroup.Select
Selects a circle rebar group from the model database. The identifier of the circle rebar group must be set.
Returns: True on success.

Tekla.Structures.Model.CircleRebarGroup.Modify
Modifies the existing circle rebar group in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.CircleRebarGroup.Delete
Deletes the circle rebar group instance with the given identifier from the model database.
Returns: True on success.